import React, { useState } from "react";
import { IoDocumentText } from "react-icons/io5";
import { MdOutlineKeyboardArrowDown } from "react-icons/md";
import HeaderTitle from "./HeaderTitle";

export default function CourseDescription({data}) {
  const [showFullContent, setShowFullContent] = useState(false);

  const handlerShowFullContent = () => {
    setShowFullContent(!showFullContent);
  };
  
  return (
    <div className="bg-white rounded-2xl p-5 sm:p-5 mt-8">
      
      {/* !<-- Header Title --> */}
      <HeaderTitle
        title='توضیحات'
        icon={<IoDocumentText/>}
        iconColor='text-amber-400'
        spanColor='bg-amber-400'
      />

      {/* text description */}
      <div className="relative overflow-hidden">
        <div
          className={`course-content max-w-none ${
            showFullContent ? "max-h-full" : "max-h-[800px]"
          } leading-10 font-danaLight text-[16px] space-y-2`}
        >
          <p>
            حقیقت تلخ شماره ۱: درصد زیادی از افرادی که یک مسیر رو شروع میکنن.
            درنهایت شکست میخورن و نتیجه ای نمیگیرن
          </p>
          <p>
            <img
              src={data.ProjectCourseImg}
              loading="lazy"
              className="w-full rounded-[25px] p-2"
            />
          </p>
          <p>
            حقیفت تلخ شماره ۲: افرادی که از حقیقت اول جان سالم به در بردن هم
            درصد کمی شون پول و رشد کمال خوبی رو تجربه میکنن!
          </p>
          <p>
            میخواید باهاتون رو راست باشم؟ همین بازیگرای هالیوود. چند درصدشون
            سیاهی لشکرن و چند درصدشون سوپر استار؟ یا اصلا جای دوری نریم. چند نفر
            از اطرافیان تون رو میشناسید که کاسب هستن و از بین اون کاسب ها چند
            نفر واقعا اوضاع خفنی داره؟ طبعا همه میدونیم که تعداد این افراد بسیار
            بسیار کمه و در دنیای برنامه نویسی. در بخش بازار کار هم اوضاع مستثنی
            از این نیست. اگر نخواهیم نگاه سوسیالیستی به مسائل داشته باشیم.
            اینگونه که همه مون بهتره فقیر باشیم و کسی لازم نکرده به جایگاه های
            بالاتر برسه. باید قبول کنیم که از بین هزاران برنامه نویسی که بصورت
            کارمندی کار میکنن. تعداد کمی شون دستمزد های بالایی میگیرن. تعداد کمی
            شون در رده های بالاتر مشغول فعالیتن
          </p>
          <p>
            برای مثال: شما ممکنه با برنامه نویس ایرانیی ملاقات کنید که در عین
            خوشحالی بگه که من ساعتی تقریبا ۱۷۰ هزار تومان(نسبت به دلار ۵۰ هزار
            تومانی) دستمزد میگیرم. اما آیا میدونستید که تعداد اندکی از این
            برنامه نویس ها هستن که دو یا سه یا حتی پنج برابر بیشتر از مبلغ ذکر
            شده دستمزدشونه؟ شاید در تصوراتتون برای چنین افراد. آدم هایی بیاد که
            قطعا بالای ۳۰ ساله برنامه نویس هستن. اما نه جانم! مسئله این نیست که
            شما سابقه بسیار بسیار خفنی داشته باشی. مسئله اینه که چقدر شناخت از
            کارفرما جماعت داری!
          </p>
          <p>
            فکت: فریلنسر موفق فردی نیست که با هزاران کارفرما در ارتباطه. بلکه
            فردیه که با شبکه سازی درست و اصولی تونسته با چند کارفرمای خردمند
            ارتباط برقرار کنه و با ارائه خدمات با کیفیت به اونها و معرفی شدنش به
            دیگران. این شبکه رو گسترش بده و گسترش شبکه با کیفیت == پول با کیفیت
            تر
          </p>
          <p>&nbsp;</p>
          <p>
            اما سوال اصلی اینجاست که چطور باید به چنین افرادی چنگ زد؟ چطور باید
            شناسایی شون کرد؟ چطور باید کار کنیم تا سعادت کار با کارفرمای خردمندی
            نصیب مون بشه که بجای غرغرای الکی سر هر پروژه. چک و چونه های وقت تلف
            کننده بیاد و تسک رو تعریف کنه و کار رو براش انجام بدیم و هزینه مون
            هم واریز بشه و هر دو به زندگی مون برسیم؟
          </p>
          <p>&nbsp;</p>
          <p>
            اصولا شما از هر فریلنسری این سوال رو بپرسی ممکنه پاسخ های متفاوتی رو
            بهتون بده. اما اگر این سوال رو از یک کارفرمایی که با فریلنسر های
            مختلف کار کرده باشه بپرسید چی؟ قطعا کیفیت پاسخ دهی بسیار بالاتر و
            فراتر از انتظاراتتونه. همونطور که شما در زمان کودکی و نوجوانی به
            جواب این سوال که اخلاق مامان باباها توی فلان مدل شرایط به چه شکله رو
            نمیتونستی از طریق پرس و جو از دوستان نزدیکت برسی و بلکه باید از یک
            پدر و مادر متشخص چنین مواردی رو میپرسیدی. بحث شناخت کارفرما ها هم به
            همین شکل هست
          </p>
          <p>&nbsp;</p>
          <p>
            و این چالش. سر آغاز تولید یک خدمت جدید از سبزلرن برای شما عزیزانه.
            در این دوره آموزشی. من:قدیر یلمه. بنیانگذار پلتفرم سبزلرن همراه شما
            هستم تا تجربیاتم رو در راستای ارتقای جایگاه شغلی شما. به اشتراک
            بزارم
          </p>
          <p>&nbsp;</p>
          <p>
            شما با شرکت در دوره مستر فریلنس. قرار هست که از زاویه دید یک
            کارفرما. به مسئله فریلنسری نگاه کنید. نقاط قوت و ضعف اونهارو بدست
            بیارید و نقاط قوت و ضعف خودتون رو بهبود ببخشید تا در یک رابطه تجاری
            پرسود. پارتنر های خوبی برای هم باشید
          </p>
          <p>
            میخواید باهاتون رو راست باشم؟ همین بازیگرای هالیوود. چند درصدشون
            سیاهی لشکرن و چند درصدشون سوپر استار؟ یا اصلا جای دوری نریم. چند نفر
            از اطرافیان تون رو میشناسید که کاسب هستن و از بین اون کاسب ها چند
            نفر واقعا اوضاع خفنی داره؟ طبعا همه میدونیم که تعداد این افراد بسیار
            بسیار کمه و در دنیای برنامه نویسی. در بخش بازار کار هم اوضاع مستثنی
            از این نیست. اگر نخواهیم نگاه سوسیالیستی به مسائل داشته باشیم.
            اینگونه که همه مون بهتره فقیر باشیم و کسی لازم نکرده به جایگاه های
            بالاتر برسه. باید قبول کنیم که از بین هزاران برنامه نویسی که بصورت
            کارمندی کار میکنن. تعداد کمی شون دستمزد های بالایی میگیرن. تعداد کمی
            شون در رده های بالاتر مشغول فعالیتن
          </p>
          <p>
            برای مثال: شما ممکنه با برنامه نویس ایرانیی ملاقات کنید که در عین
            خوشحالی بگه که من ساعتی تقریبا ۱۷۰ هزار تومان(نسبت به دلار ۵۰ هزار
            تومانی) دستمزد میگیرم. اما آیا میدونستید که تعداد اندکی از این
            برنامه نویس ها هستن که دو یا سه یا حتی پنج برابر بیشتر از مبلغ ذکر
            شده دستمزدشونه؟ شاید در تصوراتتون برای چنین افراد. آدم هایی بیاد که
            قطعا بالای ۳۰ ساله برنامه نویس هستن. اما نه جانم! مسئله این نیست که
            شما سابقه بسیار بسیار خفنی داشته باشی. مسئله اینه که چقدر شناخت از
            کارفرما جماعت داری!
          </p>
          <p>
            فکت: فریلنسر موفق فردی نیست که با هزاران کارفرما در ارتباطه. بلکه
            فردیه که با شبکه سازی درست و اصولی تونسته با چند کارفرمای خردمند
            ارتباط برقرار کنه و با ارائه خدمات با کیفیت به اونها و معرفی شدنش به
            دیگران. این شبکه رو گسترش بده و گسترش شبکه با کیفیت == پول با کیفیت
            تر
          </p>
        </div>
        <div
          className={`course-content-shadow ${
            showFullContent ? "hidden" : "block"
          } absolute bottom-0 right-0 left-0 h-[160px] bg-gradient-to-t from-white dark:from-darker from-0% via-white/[55%] dark:via-darker/[55%] via-70% to-white/0 dark:to-darker/0 to-100%`}
        ></div>
      </div>
      
      {/* !<-- Show More Text Description --> */}
      <button
        className="button-xl button-primary w-full sm:w-auto mx-auto mt-5"
        onClick={handlerShowFullContent}
      >
        <span>
          {showFullContent ? "مشاهده کمتر مطلب" : "مشاهده بیشتر مطلب"}
        </span>
        <MdOutlineKeyboardArrowDown
          className={`${showFullContent ? "rotate-180" : ""} text-[30px]`}
        />
      </button>
    </div>
  );
}
